"""5. Реализовать структуру «Рейтинг», представляющую собой набор натуральных чисел, который
не возрастает. У пользователя нужно запрашивать новый элемент рейтинга. Если в рейтинге
существуют элементы с одинаковыми значениями, то новый элемент с тем же значением
должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввёл число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввёл число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввёл число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать сразу в коде, например, my_list = [7, 5, 3, 3, 2].
"""

my_list = [7, 5, 3, 3, 2]

number = float(input('Введите новый элемент рейтинга\n'))

i = 0
for el in my_list:
    i += 1
    if el < number:
        my_list.insert(i - 1, number)
        break
else:
    my_list.append(number)
my_list.append(number)
my_list = my_list[::-1]
my_list = sorted(my_list)
my_list = my_list[::-1]
print(my_list)
